app/helper.php

    function getTotalRating($emp_id,$skill)
    {
      $empRatingData = EmployeeRatingMapping::whereEmployee_id($emp_id)->whereSkill_id($skill)->get();
---
select * from `employee_rating_mapping` where `employee_id` = '13' and `skill_id` = '9'

    function getAverageRating($emp_id,$skill){
      $skillIds = array_filter(explode(',',$skill));
      $empRatingData = EmployeeRatingMapping::whereEmployee_id($emp_id)->whereIn('skill_id',$skillIds)->get();
---
select * from `employee_rating_mapping` where `employee_id` = '13' and `skill_id` in ('3')

    function getCourseName($coursearray)
    {
      $courseName = '';
      if(!empty($coursearray)){
        $data = Course::whereIn('id',json_decode($coursearray))->get();
---
select * from `courses` where `id` in ('3', '5')