app/Http/Controllers/CourseController.php

    public function index()
    {
      $courseDetails = Course::orderBy('id', 'desc')
                        ->paginate($this->rowPerPage);
---
select * from `courses` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courses`