app/Http/Controllers/EmployeeController.php

select * from `employees` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `employees`
---
    public function index()
    {
      $employeedetails = Employees::orderBy('id', 'desc')
                      ->paginate($this->rowPerPage);

select `name`, `id` from `courses`
---
    public function create()
    {
      $breadcrumb = array();
  		$pincode=array();
      $courses = Course::pluck('name','id');