app/Http/Controllers/GroupController.php

select * from `groupings` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `groupings`
---
   public function index()
   {
     $groupDetails = Grouping::orderBy('id', 'desc')
                       ->paginate($this->rowPerPage);