app/Http/Controllers/ReportController.php

select * from `groupings` where `status` = '1' order by `id` asc
select `skill_name`, `id` from `subskills`
select * from `employees` order by `id` desc
select `skillname`, `id` from `skills` order by `id` desc
---
    public function index(Request $request)
    {
      $subskill = ''; $skill_name = array();
      if(isset($request->subskill) && ( $request->subskill > 0 )&&(!empty($request->subskill))){
        $subskill = $request->subskill;
        $subskillDetails = Subskill::find($subskill); $skill_name = $subskillDetails->toArray();
      }
      $getGroups = Grouping::whereStatus('1')->orderby('id')->get();
      if(count($getGroups)>0){
        $groupArray = array();
          foreach($getGroups as $groups){
            $averageColumn = ''; $skillsIds = '';   $innergroups = array();
            foreach($groups->skills as $skills){
              $skillsIds .= $skills['id'].',';
              $averageColumn .= $skills['skillname'].' /  ';
              $innergroups['skillsIds'] = rtrim($skillsIds,',');
              $innergroups['groupname'] = rtrim($groups->groupname,',');
              $innergroups['averagegroupName'] = rtrim($averageColumn,'/  ');
            }
              $groupArray[] = $innergroups;
          }
      }
      $groupArray = array_filter($groupArray);
    //  $this->p($groupArray);
    //   die();
      $getAllSubskills = Subskill::pluck('skill_name','id');
      $employeedetails = Employees::orderBy('id', 'desc')->get();
      // ALTER TABLE `skills` ADD `grouping` INT NOT NULL DEFAULT '0' AFTER `skillname`;
      //ALTER TABLE `skills` ADD `grouping_id` INT NOT NULL DEFAULT '1' AFTER `skillname`;
      $mainSkillArray = Skill::orderBy('id','desc')->pluck('skillname','id');