app/Http/Controllers/SubSkillController.php

select * from `subskills` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `subskills`
---
    public function index()
    {
      $skillDetails = Subskill::orderBy('id', 'desc')
      ->paginate($this->rowPerPage);